XML/Documents/ПриготовлениеПродуктов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ПриготовлениеПродуктов</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.Продукты</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Продукт</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Продукт</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Ингредиенты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Продукт</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Продукт</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

XML/AccumulationRegisters/Продукты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>Продукты</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Продукт</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Продукт</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

XML/Documents/ПриготовлениеПродуктов/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	
	Движения.Продукты.Записывать = Истина;
	
	// группируем данные таблицы -> сохраняем в ВТ -> вытаскиваем остатки из регистра накоплений -> соединяем таблицы ->
	// -> получаем итоговую таблицу с готовыми вычисленными полями
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПриготовлениеПродукцииИнгредиенты.Продукт КАК Продукт,
	|	СУММА(ПриготовлениеПродукцииИнгредиенты.Количество) КАК Количество
	|ПОМЕСТИТЬ втИнгредиентыДокумента
	|ИЗ
	|	Документ.ПриготовлениеПродуктов.Ингредиенты КАК ПриготовлениеПродукцииИнгредиенты
	|ГДЕ
	|	ПриготовлениеПродукцииИнгредиенты.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ПриготовлениеПродукцииИнгредиенты.Продукт
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втИнгредиентыДокумента.Продукт.Представление КАК Продукт,
	|	втИнгредиентыДокумента.Количество КАК Количество,
	|	ЕСТЬNULL(ПродуктыОстатки.СуммаОстаток / ПродуктыОстатки.КоличествоОстаток * втИнгредиентыДокумента.Количество, 0) КАК Сумма,
	|	ВЫБОР
	|		КОГДА втИнгредиентыДокумента.Количество <= ПродуктыОстатки.КоличествоОстаток
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК Достаточно,
	|	ПродуктыОстатки.КоличествоОстаток КАК КоличествоОстаток
	|ИЗ
	|	втИнгредиентыДокумента КАК втИнгредиентыДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.Продукты.Остатки(
	|				&МоментВремени,
	|				Продукт В
	|					(ВЫБРАТЬ
	|						втИнгредиентыДокумента.Продукт КАК Продукт
	|					ИЗ
	|						втИнгредиентыДокумента КАК втИнгредиентыДокумента)) КАК ПродуктыОстатки
	|		ПО втИнгредиентыДокумента.Продукт = ПродуктыОстатки.Продукт";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("МоментВремени", МоментВремени());
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	// списываем продукты, использованные в качестве ингредиентов
	Пока Выборка.Следующий() Цикл
		// проверка достатка
		Если Не Выборка.Достаточно Тогда
			Сообщить("Недостаточно продукта " + Выборка.ПродуктПредставление + "! Осталось " + ?(ЗначениеЗаполнено(Выборка.КоличествоОстаток), Выборка.КоличествоОстаток, 0));
			Отказ = Истина;
			Возврат;
		КонецЕсли;		
		
		Движение = Движения.Продукты.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период 	 = Дата;
		Движение.Продукт 	 = Выборка.Продукт;
		Движение.Количество  = Выборка.Количество;
		Движение.Сумма       = Выборка.Сумма;
	КонецЦикла;
	
	// записываем приготовленный продукт в регистр накоплений
	Движение = Движения.Продукты.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	Движение.Период      = Дата;
	Движение.Продукт     = Продукт;
	Движение.Количество  = Количество;
	Движение.Сумма       = Цена;
	
КонецПроцедуры
